rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" != ? ORDER BY "movies"."id" ASC LIMIT ? OFFSET ?  [["id", 1], ["LIMIT", 1], ["OFFSET", 1]]
SELECT "movies".* FROM "movies" WHERE ("movies"."director" = ? OR "movies"."id" != ?) ORDER BY "movies"."id" ASC LIMIT ? OFFSET ?  [["director", "Jon Favreau"], ["id", 1], ["LIMIT", 1], ["OFFSET", 1]]
---
  def show_by_director
    @movie = Movie.find(params[:id])
    @director = @movie.director
    if(@director != nil)
      if(@director.empty?)
        redirect_to movies_path
        flash[:warning] = "'#{@movie.title}' has no director info"
      else
        @movies = Movie.where(:director => @director).and(Movie.where.not(:id => @movie.id))

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "movies" SET "updated_at" = ?, "director" = ? WHERE "movies"."id" = ?  [["updated_at", "2022-01-09 18:04:41.941239"], ["director", "Ridley Scott"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update(movie_params)